app/controllers/account_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."username" = 'soto'  ORDER BY "users"."id" ASC LIMIT 1
UPDATE "users" SET "token" = ?, "updated_at" = ? WHERE "users"."id" = 2  [["token", "6f94a6b273cf8542a5bcdf09d9c34b8c"], ["updated_at", "2014-06-02 05:35:12.016809"]]
---
  def signin
    if params[:username].present? && params[:password].present?
      found_user = User.where(:username => params[:username]).first
      if found_user
        auth_user = found_user.authenticate(Digest::SHA1.hexdigest(params[:password]))
        if auth_user
          result = false
          until result
            token = SecureRandom.hex + Time.now.to_i.to_s
            auth_user.token = token
            result = auth_user.save

INSERT INTO "users" ("created_at", "password", "token", "updated_at", "username") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-06-01 07:50:04.233634"], ["password", "banana"], ["token", "e32d308e2a897f2b96b2bba4f0123dd7"], ["updated_at", "2014-06-01 07:50:04.233634"], ["username", "soto"]]
---
  def create_user
    user = User.new(:username => params[:username],
                    :password => Digest::SHA1.hexdigest(params[:password]),
                    :token => SecureRandom.hex + Time.now.to_i.to_s)
    response = user.save

SELECT  "users".* FROM "users"  WHERE "users"."username" = 'soto3' LIMIT 1
SELECT "games".* FROM "games"  WHERE "games"."user_id" = ?  [["user_id", 7]]
---
  def get_user_data
    usr = User.find_by username: params[:id]
    games = Game.find_by_user_id(usr.id)