app/controllers/games_controller.rb

  def create
    user = User.find_by token: request.headers['tkn']
    if user
      game = user.games.new(:name => params[:name], :platform => params[:platform])
      game_inserted = user.save
---
SELECT  "users".* FROM "users"  WHERE "users"."token" = '8dfea40f767f461c74516d7612837d0f1401887590' LIMIT 1
INSERT INTO "games" ("created_at", "name", "platform", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-06-05 06:37:42.937604"], ["name", "Call of Duty"], ["platform", "PS3"], ["updated_at", "2014-06-05 06:37:42.937604"], ["user_id", 7]]